app/controllers/studies_controller.rb

SELECT "studies".* FROM "studies" ORDER BY "studies"."created_at" DESC
---
  def index
    studies = Study.includes(:study_parameters, :submissions).order(created_at: :desc)
    render json: { studies: studies.map { |study| study_summary(study) } }